app/controllers/mobile_markets_controller.rb

  def index
    @mobile_markets = MobileMarket.all
---
SELECT "mobile_markets".* FROM "mobile_markets"