app/controllers/shops_controller.rb

  def index
    @shops = Shop.all
---
SELECT "shops".* FROM "shops" WHERE (type = 'MobileMarket')